// const [dver, setDver] = useState([
//   {
//     model: 0,
//     svet: 0,
//     gluxSteklo: 0,
//     Boyn: 0,
//     eni: 0,
//     sht: 0,
//     m2: 0,
//     n_boyn: 0,
//     n_enim: 0,
//     n_shtm: 0,
//     k_metr: 0,
//     k_sht: 0,
//     karbon: 0,
//     d_boyn: 0,
//     d_eni: 0,
//     d_sht: 0,
//     kub: 0,
//     noch: 0,
//     paska: 0,
//   },
//   {
//     model: 0,
//     svet: 0,
//     gluxSteklo: 0,
//     Boyn: 0,
//     eni: 0,
//     sht: 0,
//     m2: 0,
//     n_boyn: 0,
//     n_enim: 0,
//     n_shtm: 0,
//     k_metr: 0,
//     k_sht: 0,
//     karbon: 0,
//     d_boyn: 0,
//     d_eni: 0,
//     d_sht: 0,
//     kub: 0,
//     noch: 0,
//     paska: 0,
//   },
// ])

export const dataType = {
  Ламинат: {
    Узор: {
      Двери: {
        цена: '460000',
        единицы: 'м2',
      },
      Карона: {
        цена: '180000',
        единицы: 'м',
      },
      Наличник: {
        цена: '400000',
        единицы: 'м',
      },

      Добор: {
        цена: '220000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '15000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '20000',
        единицы: 'шт',
      },
    },
    Штапик: {
      Двери: {
        цена: '630000',
        единицы: 'м2',
      },
      Карона: {
        цена: '180000',
        единицы: 'м',
      },
      Наличник: {
        цена: '400000',
        единицы: 'м',
      },

      Добор: {
        цена: '180000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '15000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '20000',
        единицы: 'шт',
      },
    },
  },
  Шпон: {
    Узор: {
      Двери: {
        цена: '740000',
        единицы: 'м2',
      },
      Карона: {
        цена: '220000',
        единицы: 'м',
      },
      Наличник: {
        цена: '450000',
        единицы: 'м',
      },

      Добор: {
        цена: '220000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '15000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '20000',
        единицы: 'шт',
      },
    },
    Штапик: {
      Двери: {
        цена: '860000',
        единицы: 'м2',
      },
      Карона: {
        цена: '220000',
        единицы: 'м',
      },
      Наличник: {
        цена: '450000',
        единицы: 'м',
      },

      Добор: {
        цена: '220000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '15000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '20000',
        единицы: 'шт',
      },
    },
    'Узор+Грав': {
      Двери: {
        цена: '920000',
        единицы: 'м2',
      },
      Карона: {
        цена: '220000',
        единицы: 'м',
      },
      Наличник: {
        цена: '700000',
        единицы: 'м',
      },

      Добор: {
        цена: '220000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '30000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '40000',
        единицы: 'шт',
      },
    },
    'Штапик+Грав': {
      Двери: {
        цена: '1090000',
        единицы: 'м2',
      },
      Карона: {
        цена: '220000',
        единицы: 'м',
      },
      Наличник: {
        цена: '700000',
        единицы: 'м',
      },

      Добор: {
        цена: '220000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '30000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '40000',
        единицы: 'шт',
      },
    },
  },
  'Ясен Шпон': {
    Узор: {
      Двери: {
        цена: '920000',
        единицы: 'м2',
      },
      Карона: {
        цена: '250000',
        единицы: 'м',
      },
      Наличник: {
        цена: '500000',
        единицы: 'м',
      },

      Добор: {
        цена: '250000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '20000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '25000',
        единицы: 'шт',
      },
    },
    Штапик: {
      Двери: {
        цена: '1030000',
        единицы: 'м2',
      },
      Карона: {
        цена: '250000',
        единицы: 'м',
      },
      Наличник: {
        цена: '500000',
        единицы: 'м',
      },

      Добор: {
        цена: '250000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '20000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '25000',
        единицы: 'шт',
      },
    },
    'Узор+Грав': {
      Двери: {
        цена: '1030000',
        единицы: 'м2',
      },
      Карона: {
        цена: '250000',
        единицы: 'м',
      },
      Наличник: {
        цена: '7500000',
        единицы: 'м',
      },

      Добор: {
        цена: '250000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '30000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '40000',
        единицы: 'шт',
      },
    },
    'Штапик+Грав': {
      Двери: {
        цена: '1130000',
        единицы: 'м2',
      },
      Карона: {
        цена: '250000',
        единицы: 'м',
      },
      Наличник: {
        цена: '7500000',
        единицы: 'м',
      },

      Добор: {
        цена: '250000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '30000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '40000',
        единицы: 'шт',
      },
    },
  },
  'Ак МДФ': {
    Узор: {
      Двери: {
        цена: '800000',
        единицы: 'м2',
      },
      Карона: {
        цена: '250000',
        единицы: 'м',
      },
      Наличник: {
        цена: '500000',
        единицы: 'м',
      },

      Добор: {
        цена: '250000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '20000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '25000',
        единицы: 'шт',
      },
    },
    Штапик: {
      Двери: {
        цена: '920000',
        единицы: 'м2',
      },
      Карона: {
        цена: '250000',
        единицы: 'м',
      },
      Наличник: {
        цена: '500000',
        единицы: 'м',
      },

      Добор: {
        цена: '250000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '20000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '25000',
        единицы: 'шт',
      },
    },
    'Узор+Грав': {
      Двери: {
        цена: '920000',
        единицы: 'м2',
      },
      Карона: {
        цена: '250000',
        единицы: 'м',
      },
      Наличник: {
        цена: '7500000',
        единицы: 'м',
      },

      Добор: {
        цена: '250000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '30000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '40000',
        единицы: 'шт',
      },
    },
    'Штапик+Грав': {
      Двери: {
        цена: '1030000',
        единицы: 'м2',
      },
      Карона: {
        цена: '250000',
        единицы: 'м',
      },
      Наличник: {
        цена: '7500000',
        единицы: 'м',
      },

      Добор: {
        цена: '250000',
        единицы: 'м2',
      },
      Кубик: {
        цена: '30000',
        единицы: 'шт',
      },
      Ночка: {
        цена: '40000',
        единицы: 'шт',
      },
    },
  },
  Универсальный: {
    нет: {
      Двери: {
        цена: '0',
        единицы: 'м2',
      },
      Карона: {
        цена: '0',
        единицы: 'м',
      },
      Наличник: {
        цена: '0',
        единицы: 'м',
      },

      Добор: {
        цена: '0',
        единицы: 'м2',
      },
      Кубик: {
        цена: '0',
        единицы: 'шт',
      },
      Ночка: {
        цена: '0',
        единицы: 'шт',
      },
    },
  },
}

let str = 'hello'

export default str
